use std::io::{Read, Write};
// =================================================================================================

// Это реализация изоляции для FFI - чтобы мы могли безопасно обрабатывать такие пограничные места.

// =================================================================================================

pub fn workerMain() 
{
  // Читаем всё, что пришло в stdin
  let mut input = Vec::new();
  if let Err(e) = std::io::stdin().read_to_end(&mut input) {
    eprintln!("Ошибка чтения stdin: {}", e); // todo remove
    std::process::exit(1);
  }

  // todo Делаем что-то полезное

  // Отдаём результат в stdout
  if let Err(e) = std::io::stdout().write_all(&input) {
    eprintln!("Ошибка записи stdout: {}", e); // todo remove
    std::process::exit(1);
  }
}

// =================================================================================================