// todo imports
// =================================================================================================

// Потолки Value/calculate: TokenType бесконечен, но мы ограничены математикой Rust.
//
// Здесь не тестируются структуры - т.к. это часть TokenType а не StructureType.

// =================================================================================================

/*
  todo
    Здесь должны быть тесты целых + дробных чисел на выход за границы.
    
    Так как токен бесконечный - мы работаем только с ограничениями математики Rust.
    
    Т.е. `(1e308 + 1e308) - (1e308 + 1e308)` сейчас ломается в calculate.
    
    Это потому что на Token/TokenType не написана нормализация.
    
    По сути должно было быть:
      1. 1e309 границы чек - нормализация.
      2. (1e308 + 1e308) - результат выше - нормализация до 1e308.
      3. Вычитание одинаково в данном примере = 0 по итогу.
    
    И тогда мы понимаем что всего 4 типа: Float/UFloat и Int/UInt.
    
    У каждого граница - это Rust: f64, isize/usize. Их - и + потолки.
    
    По примерам StructureType + #71 описанию - понятна нормализация.
    
    Именно поэтому здесь не тесты: `a = ...`, а только выражения Tokens.
*/

// =================================================================================================
