use crate::parser::testing::checkStructure;
// =================================================================================================

// Тесты составных операторов.
//
// Обычное выражение: `a = a + 10`;
//
// Составной оператор: `a += 10`.
//
//
// todo Возможно тут не хватает еще некоторых тестов?

// =================================================================================================
// +=

/// todo desc
#[test]
fn plusEquals() -> ()
{
  checkStructure!(
    r#"
    a~ := 10
    a += 5
    "#,
    "a",
    value "15"
  );
}

/// todo desc
#[test]
fn plusEqualsTwice() -> ()
{
  checkStructure!(
    r#"
    a~ := 10
    a += 5
    a += 3
    "#,
    "a",
    value "18"
  );
}

// =================================================================================================
// -=

/// todo desc
#[test]
fn minusEquals() -> ()
{
  checkStructure!(
    r#"
    a~ := 10
    a -= 3
    "#,
    "a",
    value "7"
  );
}

// =================================================================================================
// *=

/// todo desc
#[test]
fn multiplyEquals() -> ()
{
  checkStructure!(
    r#"
    a~ := 10
    a *= 2
    "#,
    "a",
    value "20"
  );
}

// =================================================================================================
// /=

/// todo desc
#[test]
fn divideEquals() -> ()
{
  checkStructure!(
    r#"
    a~ := 10
    a /= 2
    "#,
    "a",
    value "5"
  );
}

/// todo desc
#[test]
fn divideEqualsInt() -> ()
{
  checkStructure!(
    r#"
    a~ := 10
    a /= 4
    "#,
    "a",
    value "2"
  );
}

// =================================================================================================