
// =================================================================================================

/// Файл, который был запущен изначально.
/// 
/// todo Раньше был режим запуска кода напрямую, или тот `lib` есть -
///  все это по сути не требует этот параметр?
pub static _filePath: std::sync::OnceLock<String> = std::sync::OnceLock::new();

thread_local!
{
  /// Файл, код которого исполняется прямо сейчас;
  /// `None` — запущенный файл из `_filePath`.
  ///
  /// От этого файла `import()` считает относительные пути;
  /// Меняется на время `import()` и на время вызова функции из импортированного файла,
  /// структуры запоминают его при создании (`Structure::sourcePath`).
  ///
  /// `thread_local!` нужен т.к. здесь может быть параллельное изменение.
  /// 
  /// todo Кстати RTS работает через однопоточное чтение, но `thread_local!`
  ///  здесь может быть использован при многопоточной работе в будущем.
  pub static _sourcePath: std::cell::RefCell<Option<std::sync::Arc<String>>> =
    const { std::cell::RefCell::new(None) };
}

// =================================================================================================

/// Количество аргументов переданных при запуске.
/// 
/// todo Может не быть в некоторых сборках.
pub static _argc: std::sync::OnceLock<usize> = std::sync::OnceLock::new();

/// Вектор аргументов переданный при запуске.
///
/// todo Может не быть в некоторых сборках.
pub static _argv: std::sync::OnceLock< Vec<String> > = std::sync::OnceLock::new();

// =================================================================================================

/// Значение, которое вернёт программа при завершении.
pub static _exitCode: std::sync::atomic::AtomicI32 = std::sync::atomic::AtomicI32::new(0);

/// Завершилась ли программа?
/// 
/// todo Зачем он нужен если есть exit code?
pub static _exit: std::sync::atomic::AtomicBool = std::sync::atomic::AtomicBool::new(false);

// =================================================================================================

/// Версия RTS. Это нужно для внутреннего хранения
/// и показа как например в `bin` режиме.
pub static _version: &str = "241201";

// =================================================================================================
